#+PROPERTY: header-args:lisp :results replace

** Add a =hunchentoot= dependency in the shell environment

In order to make =hunchentoot= available in the nix shell environment, you need
adjust =shell.nix=.
#+name: shell.nix-revised
#+caption: shell.nix revised
#+header: :tangle shell.nix
#+begin_src sh
  let
    nixpkgs = fetchTarball "https://github.com/NixOS/nixpkgs/tarball/nixos-24.05";
    pkgs = import nixpkgs { config = {}; overlays = []; };
    sbcl' = pkgs.sbcl.withPackages (ps: with ps; [ hunchentoot ]);
  in
    pkgs.mkShellNoCC {
      packages = [ sbcl' ];
  }
#+end_src

After reloading an environment by =direnv reload=,
again you type following on sbcl repl.
#+name: sbcl-setup revised
#+caption: Load cl-tutorial system
#+begin_src lisp
  (load (sb-ext:posix-getenv "ASDF"))
  (pushnew (truename "./.") asdf:*central-registry*)
  (asdf:load-system "cl-tutorial")
#+end_src

#+RESULTS: sbl-setup revised
WARNING: System definition file #P"/nix/store/db65yvmfx3zscw71kfkqz2rnnmj5kngw-sbcl-hunchentoot-v1.3.0/hunchentoot.asd" contains definition for system "hunchentoot-test". Please only define "hunchentoot" and secondary systems with a name starting with "hunchentoot/" (e.g. "hunchentoot/test") in that file.
WARNING: System definition file #P"/nix/store/db65yvmfx3zscw71kfkqz2rnnmj5kngw-sbcl-hunchentoot-v1.3.0/hunchentoot.asd" contains definition for system "hunchentoot-dev". Please only define "hunchentoot" and secondary systems with a name starting with "hunchentoot/" (e.g. "hunchentoot/test") in that file.
; compiling file "/home/c/cl-tutorial/main.lisp" (written 16 NOV 2024 10:19:26 PM):

; wrote /home/c/.cache/common-lisp/sbcl-2.4.4-linux-arm64/home/c/cl-tutorial/main-tmpGHU3ALSV.fasl
; compilation finished in 0:00:00.011
T


This should bring you to the =cl-tutorial= system. Try
#+begin_src lisp
  (in-package :cl-tutorial)
#+end_src

#+RESULT:
#<PACKAGE "CL-TUTORIAL">


